Public Member Functions | List of all members
API_IDialogEventHandler Class Referenceabstract
Notifications Manager
Defining an interface for Dialog event handlers. More...
#include <APIdefs_Callback.h>
 Inheritance diagram for API_IDialogEventHandler:
 Public Member Functions
 virtual void  | EnableAllInfoDialog () const =0
Event handler in case of enabling all informational messages in the Work Environment.
Detailed Description
Defining an interface for Dialog event handlers.
Since
Archicad 26